# Description
# 为了决定去哪个影院看《昨日青空》，毛学姐和他的基友两只单身狗决定抛硬币决定最终去哪儿.在以前,他们为了决定去哪个电影院已经抛掷了若干次，其中有a次正面向上和b次反面向上.而且约定了如果正面向上就是毛学姐赢,否则是他的基友赢.现在告诉你他们以前抛掷的结果，请告诉毛学姐，这次为了看《昨日青空》，他如愿去自己想去的电影院的概率是多少。
#
# Input
# 输入数据第一行是一个正整数T，保证有T组测试数据，保证.T<=103 接下来一共T行，每行有两个正整数a,b，保证1<=a,b<=260.保证毛学姐和基友想去的电影院不一致且抛掷结果只会出现正面向上或者反面向上。
#
# Output
# 输出一行，表示小S赢的概率，精确到小数点后12位有效数字,你的答案必须和参考答案完全一致才算正确. 每次答案输出一行。
#
# Sample Input
# 1
# 999 999
# Sample Output
#0.500000000000
#答案：
n =int(input())
while n :
    str = input()
    print("0.500000000000")
    n -= 1